cmsis-svd/cmsis-svd/data/Spansion/MB9BF51xS_svd.xml
        <!-- REGISTER "DDR7" -->
        <register derivedFrom="PFR7">
          <name>DDR7</name>
          <description>Port input/output direction setting register 7</description>
          <addressOffset>0x21C</addressOffset>
        </register>
        <!-- REGISTER "DDR8" -->
        <register derivedFrom="PFR8">
          <name>DDR8</name>
          <description>Port input/output direction setting register 8</description>
          <addressOffset>0x220</addressOffset>
        </register>
        <!-- REGISTER "DDRA" -->
        <register derivedFrom="PFRA">
          <name>DDRA</name>
          <description>Port input/output direction setting register A</description>
          <addressOffset>0x228</addressOffset>
        </register>
        <!-- REGISTER "DDRC" -->
        <register derivedFrom="PFRC">
          <name>DDRC</name>
          <description>Port input/output direction setting register C</description>
          <addressOffset>0x230</addressOffset>
        </register>
        <!-- REGISTER "DDRD" -->
        <register derivedFrom="PFRD">
          <name>DDRD</name>
          <description>Port input/output direction setting register D</description>
          <addressOffset>0x234</addressOffset>
        </register>
        <!-- REGISTER "DDRE" -->
        <register derivedFrom="PFRE">
          <name>DDRE</name>
          <description>Port input/output direction setting register E</description>
          <addressOffset>0x238</addressOffset>
        </register>
        <!-- REGISTER "DDRF" -->
        <register derivedFrom="PFRF">
          <name>DDRF</name>
          <description>Port input/output direction setting register F</description>
          <addressOffset>0x23C</addressOffset>
        </register>
        <!-- REGISTER "PDIR0" -->
        <register derivedFrom="DDR0">
          <name>PDIR0</name>
          <description>Port input data register 0</description>
          <addressOffset>0x300</addressOffset>
        </register>
        <!-- REGISTER "PDIR1" -->
        <register derivedFrom="DDR1">
          <name>PDIR1</name>
          <description>Port input data register 1</description>
          <addressOffset>0x304</addressOffset>
        </register>
        <!-- REGISTER "PDIR2" -->
        <register derivedFrom="DDR2">
          <name>PDIR2</name>
          <description>Port input data register 2</description>
          <addressOffset>0x308</addressOffset>
        </register>
        <!-- REGISTER "PDIR3" -->
        <register derivedFrom="DDR3">
          <name>PDIR3</name>
          <description>Port input data register 3</description>
          <addressOffset>0x30C</addressOffset>
        </register>
        <!-- REGISTER "PDIR4" -->
        <register derivedFrom="DDR4">
          <name>PDIR4</name>
          <description>Port input data register 4</description>
          <addressOffset>0x310</addressOffset>
        </register>
        <!-- REGISTER "PDIR5" -->
        <register derivedFrom="DDR5">
          <name>PDIR5</name>
          <description>Port input data register 5</description>
          <addressOffset>0x314</addressOffset>
        </register>
        <!-- REGISTER "PDIR6" -->
        <register derivedFrom="DDR6">
          <name>PDIR6</name>
          <description>Port input data register 6</description>
          <addressOffset>0x318</addressOffset>
        </register>
        <!-- REGISTER "PDIR7" -->
        <register derivedFrom="DDR7">
          <name>PDIR7</name>
          <description>Port input data register 7</description>
          <addressOffset>0x31C</addressOffset>
        </register>
        <!-- REGISTER "PDIR8" -->
        <register derivedFrom="DDR8">
          <name>PDIR8</name>
          <description>Port input data register 8</description>
          <addressOffset>0x320</addressOffset>
        </register>
        <!-- REGISTER "PDIRA" -->
        <register derivedFrom="DDRA">
          <name>PDIRA</name>
          <description>Port input data register A</description>
          <addressOffset>0x328</addressOffset>
        </register>
        <!-- REGISTER "PDIRC" -->
        <register derivedFrom="DDRC">
          <name>PDIRC</name>
          <description>Port input data register C</description>
          <addressOffset>0x330</addressOffset>
        </register>
        <!-- REGISTER "PDIRD" -->
        <register derivedFrom="DDRD">
          <name>PDIRD</name>
          <description>Port input data register D</description>
          <addressOffset>0x334</addressOffset>
        </register>
        <!-- REGISTER "PDIRE" -->
        <register derivedFrom="DDRE">
          <name>PDIRE</name>
          <description>Port input data register E</description>
          <addressOffset>0x338</addressOffset>
        </register>
        <!-- REGISTER "PDIRF" -->
        <register derivedFrom="DDRF">
          <name>PDIRF</name>
          <description>Port input data register F</description>
          <addressOffset>0x33C</addressOffset>
        </register>
        <!-- REGISTER "PDOR0" -->
        <register derivedFrom="DDR0">
          <name>PDOR0</name>
          <description>Port output data register 0</description>
          <addressOffset>0x400</addressOffset>
        </register>
        <!-- REGISTER "PDOR1" -->
        <register derivedFrom="DDR1">
          <name>PDOR1</name>
          <description>Port output data register 1</description>
          <addressOffset>0x404</addressOffset>
        </register>
        <!-- REGISTER "PDOR2" -->
        <register derivedFrom="DDR2">
          <name>PDOR2</name>
          <description>Port output data register 2</description>
          <addressOffset>0x408</addressOffset>
        </register>
        <!-- REGISTER "PDOR3" -->
        <register derivedFrom="DDR3">
          <name>PDOR3</name>
          <description>Port output data register 3</description>
          <addressOffset>0x40C</addressOffset>
        </register>
        <!-- REGISTER "PDOR4" -->
        <register derivedFrom="DDR4">
          <name>PDOR4</name>
          <description>Port output data register 4</description>
          <addressOffset>0x410</addressOffset>
        </register>
        <!-- REGISTER "PDOR5" -->
        <register derivedFrom="DDR5">
          <name>PDOR5</name>
          <description>Port output data register 5</description>
          <addressOffset>0x414</addressOffset>
        </register>
